app/views/children/show.html.erb


		<!-- <% @child.daily_reports.each do |d| %>
---
SELECT "daily_reports".* FROM "daily_reports" WHERE "daily_reports"."child_id" = ?  [["child_id", 1]]