app/controllers/daily_reports_controller.rb

  def show
    @daily_report = @child.daily_reports.find(params[:id])
---
SELECT  "daily_reports".* FROM "daily_reports" WHERE "daily_reports"."child_id" = ? AND "daily_reports"."id" = ? LIMIT 1  [["child_id", 1], ["id", 1]]

  def create
    @daily_report = @child.daily_reports.build(daily_report_params)
    if @daily_report.save
---
INSERT INTO "daily_reports" ("wet_diapers", "poopy_diapers", "bullying_incident", "bullying_report", "ouch_incident", "ouch_report", "date", "child_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)