app/controllers/guides_controller.rb

  def show
    @guide = Guide.find(params[:id])
---
SELECT  "guides".* FROM "guides" WHERE "guides"."id" = ? LIMIT 1  [["id", 1]]