app/controllers/kind_acts_controller.rb

SELECT "kind_acts".* FROM "kind_acts"
---
  def index
    @kind_acts = KindAct.all