app/controllers/observations_controller.rb

  def show
    @observation = Observation.find(params[:id])
---
SELECT  "observations".* FROM "observations" WHERE "observations"."id" = ? LIMIT 1  [["id", 2]]