app/views/daily_reports/show.html.erb

SELECT  "kind_acts".* FROM "kind_acts" WHERE "kind_acts"."daily_report_id" = ?  ORDER BY "kind_acts"."id" DESC LIMIT 1  [["daily_report_id", 1]]
SELECT COUNT(*) FROM "kind_acts" WHERE "kind_acts"."daily_report_id" = ?  [["daily_report_id", 1]]
---

	<% if @daily_report.kind_acts.count > 0 %>

SELECT "observations".* FROM "observations" WHERE "observations"."daily_report_id" = ?  [["daily_report_id", 1]]
---
	<ul>
		<% @daily_report.observations.each do |o| %>